# DoubLines

## Description
Procedure DoubLines sets the line spacing width for double-line tools.&lt;BR&gt;

```pascal
PROCEDURE DoubLines(doubleLineDistance : REAL (Coordinate));
```

```python

def vs.DoubLines(doubleLineDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|doubleLineDistance|REAL (Coordinate)|Width between lines.|

## Examples
```pascal
DoubLines(1/2&quot;);

```

## Version
```diff
- DoubLines is obsolete as of VectorWorks12.5
```

Availability: from MiniCAD
## Category
* Document Settings